# Eksik Gözlem Analizi

>veri seetindeki eksiklik rastgele oluşmamışsa silme işlemi ciddi yanlılıklara sebebiyet verir.

* Veri Serindeki eksikliğin yapısal bir eksiklik olup olmadığının bilimmesi gerekir
* NA ger zaman eksiklik anlamına gelmez
* Bilgi kaybı

### Eksik Veri Türleri

* Tümüyle raslantısal kayıp: Dipğer değişkenlerden yada yapısal problemlerden kaynaklanmayan tamame rastgele oluşan gözlemler
* Raslantısal kayıp: Diğer değişkenlere bağlı olarak oluşabilen eksiklik türe
* Raslantısal ommayan kayıp: Göz ardı edilemeycek olan yapısal problemler ile ortaya çıkan eksiklik türü

### Rassallık Kontrol Yöntemleri
* Görsel teknikler
* bağımsız iki örneklem T testi
* korelasyı-on testi
* Little'nin MCAR testi

" The ide of imputation is both seductive and dangerous "

### Silme Yöntemleri
* Gözlem yada değişkne silme yöntemi
* Liste bazında silme yöntemi (listwise method)
* Çifler bazında silme yöntemi (pairwise method)

### Değer Atama Yöntemleri
* Ortanca, ortalama, medyan
* En benzer birime atama (hot deck)
* Dış kaynaklı atama

### Tahmine Dayalı Yöntemler
* Makine öğrenmesi
* EM
* Çoklu atama yöntemi

In [40]:
# Hızlı çözüm
import numpy as np
import pandas as pd
V1= np.array([1,3,6,np.NAN, 7,1,np.NAN,9,15])
V2 = np.array([7,np.NaN,5,8,12,np.NaN,np.NaN,2,3])
V3 = np.array([np.NaN,12,5,6,14,7,np.NaN,2,31])
df=pd.DataFrame({
    "V1":V1,
    "V2":V2,
    "V3":V3 } )
df

     V1    V2    V3
0   1.0   7.0   NaN
1   3.0   NaN  12.0
2   6.0   5.0   5.0
3   NaN   8.0   6.0
4   7.0  12.0  14.0
5   1.0   NaN   7.0
6   NaN   NaN   NaN
7   9.0   2.0   2.0
8  15.0   3.0  31.0

In [13]:
df.isnull().sum()

V1    2
V2    3
V3    2
dtype: int64

In [5]:
df.notnull().sum()

V1    7
V2    6
V3    7
dtype: int64

In [6]:
df.isnull().sum().sum()

7

In [8]:
df.isnull()

      V1     V2     V3
0  False  False   True
1  False   True  False
2  False  False  False
3   True  False  False
4  False  False  False
5  False   True  False
6   True   True   True
7  False  False  False
8  False  False  False

In [16]:
df[df.isnull().any(axis=1)]
# e n az bir tane eksik değer olanları getir

    V1   V2    V3
0  1.0  7.0   NaN
1  2.0  NaN  12.0
3  NaN  8.0   6.0
5  1.0  NaN   7.0
6  NaN  NaN   NaN

In [18]:
df[df.notnull().all(axis=1)]
#hepsi dolu olanları getir
#sütunlara yani değişkenlere göre

     V1    V2    V3
2   3.0   5.0   5.0
4   7.0  12.0  14.0
7   9.0   2.0   2.0
8  15.0   3.0  31.0

In [19]:
df[df["V1"].notnull() & df["V2"].notnull() & df["V3"].notnull()]
#all(axis=1) kullanmadan hepsi dolu olanları ek-lde etme

     V1    V2    V3
2   3.0   5.0   5.0
4   7.0  12.0  14.0
7   9.0   2.0   2.0
8  15.0   3.0  31.0

In [21]:
#eksik değerlerin direkt silinmesi
df.dropna()
#sadece bir tane dahi eksik değer olan gözlmeleri siler bu fonksiyon

     V1    V2    V3
2   3.0   5.0   5.0
4   7.0  12.0  14.0
7   9.0   2.0   2.0
8  15.0   3.0  31.0

In [23]:
df
# ama kalıcı olmaz

     V1    V2    V3
0   1.0   7.0   NaN
1   2.0   NaN  12.0
2   3.0   5.0   5.0
3   NaN   8.0   6.0
4   7.0  12.0  14.0
5   1.0   NaN   7.0
6   NaN   NaN   NaN
7   9.0   2.0   2.0
8  15.0   3.0  31.0

In [25]:
#kalıcı olması için  inplace aktifleştirilir
df.dropna(inplace=True)
df

     V1    V2    V3
2   3.0   5.0   5.0
4   7.0  12.0  14.0
7   9.0   2.0   2.0
8  15.0   3.0  31.0

In [42]:
# Basit değer atama
df["V1"]
# eksik değerler ortlamaa atama

0     1.0
1     3.0
2     6.0
3     NaN
4     7.0
5     1.0
6     NaN
7     9.0
8    15.0
Name: V1, dtype: float64

In [41]:
#df["V1"][df["V1"].isnull()]=df["V1"].mean()
#df["V1"] my meethod 

df["V1"].fillna(df["V1"].mean())

0     1.0
1     3.0
2     6.0
3     6.0
4     7.0
5     1.0
6     6.0
7     9.0
8    15.0
Name: V1, dtype: float64

In [45]:
df["V1"].fillna(0)
# yani fillna fnksiyonu boşluları isteğimiz değer ile foldurmamızı sağlar

0     1.0
1     3.0
2     6.0
3     0.0
4     7.0
5     1.0
6     0.0
7     9.0
8    15.0
Name: V1, dtype: float64

In [46]:
#çok değişkenli doldurma işlemi
#satırlara göre doldurma yapıcaaz

In [47]:
df.apply(lambda x: x.fillna(x.mean()), axis=0)

     V1         V2    V3
0   1.0   7.000000  11.0
1   3.0   6.166667  12.0
2   6.0   5.000000   5.0
3   6.0   8.000000   6.0
4   7.0  12.000000  14.0
5   1.0   6.166667   7.0
6   6.0   6.166667  11.0
7   9.0   2.000000   2.0
8  15.0   3.000000  31.0